PSI/Practica3/v6 (Machacasaurio)/cuatroEnRayacliente/.svn/pristine/5f/5f97ecfe0990ca22a4e188f3339f7f6737c0ec6b.svn-base

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.3 (tags/2.3-7528; 2013-04-29T19:34:10+0000) JAXWS-RI/2.2.8 JAXWS/2.2 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webservice/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webservice/" name="WebServiceServer">
<types>
<xsd:schema>
<xsd:import namespace="http://webservice/" schemaLocation="http://localhost:39851/CuatroEnRayaServer/WebServiceServer?xsd=1"/>
</xsd:schema>
</types>
<message name="login">
<part name="parameters" element="tns:login"/>
</message>
<message name="loginResponse">
<part name="parameters" element="tns:loginResponse"/>
</message>
<message name="logout">
<part name="parameters" element="tns:logout"/>
</message>
<message name="createUser">
<part name="parameters" element="tns:createUser"/>
</message>
<message name="createUserResponse">
<part name="parameters" element="tns:createUserResponse"/>
</message>
<message name="Exception">
<part name="fault" element="tns:Exception"/>
</message>
<message name="createGame">
<part name="parameters" element="tns:createGame"/>
</message>
<message name="createGameResponse">
<part name="parameters" element="tns:createGameResponse"/>
</message>
<message name="makeMove">
<part name="parameters" element="tns:makeMove"/>
</message>
<message name="makeMoveResponse">
<part name="parameters" element="tns:makeMoveResponse"/>
</message>
<message name="show">
<part name="parameters" element="tns:show"/>
</message>
<message name="showResponse">
<part name="parameters" element="tns:showResponse"/>
</message>
<message name="makeComputerMove">
<part name="parameters" element="tns:makeComputerMove"/>
</message>
<message name="makeComputerMoveResponse">
<part name="parameters" element="tns:makeComputerMoveResponse"/>
</message>
<message name="hasWon">
<part name="parameters" element="tns:hasWon"/>
</message>
<message name="hasWonResponse">
<part name="parameters" element="tns:hasWonResponse"/>
</message>
<portType name="WebServiceServer">
<operation name="login">
<input wsam:Action="http://webservice/WebServiceServer/loginRequest" message="tns:login"/>
<output wsam:Action="http://webservice/WebServiceServer/loginResponse" message="tns:loginResponse"/>
</operation>
<operation name="logout">
<input wsam:Action="http://webservice/WebServiceServer/logout" message="tns:logout"/>
</operation>
<operation name="createUser">
<input wsam:Action="http://webservice/WebServiceServer/createUserRequest" message="tns:createUser"/>
<output wsam:Action="http://webservice/WebServiceServer/createUserResponse" message="tns:createUserResponse"/>
<fault message="tns:Exception" name="Exception" wsam:Action="http://webservice/WebServiceServer/createUser/Fault/Exception"/>
</operation>
<operation name="createGame">
<input wsam:Action="http://webservice/WebServiceServer/createGameRequest" message="tns:createGame"/>
<output wsam:Action="http://webservice/WebServiceServer/createGameResponse" message="tns:createGameResponse"/>
</operation>
<operation name="makeMove">
<input wsam:Action="http://webservice/WebServiceServer/makeMoveRequest" message="tns:makeMove"/>
<output wsam:Action="http://webservice/WebServiceServer/makeMoveResponse" message="tns:makeMoveResponse"/>
</operation>
<operation name="show">
<input wsam:Action="http://webservice/WebServiceServer/showRequest" message="tns:show"/>
<output wsam:Action="http://webservice/WebServiceServer/showResponse" message="tns:showResponse"/>
</operation>
<operation name="makeComputerMove">
<input wsam:Action="http://webservice/WebServiceServer/makeComputerMoveRequest" message="tns:makeComputerMove"/>
<output wsam:Action="http://webservice/WebServiceServer/makeComputerMoveResponse" message="tns:makeComputerMoveResponse"/>
</operation>
<operation name="hasWon">
<input wsam:Action="http://webservice/WebServiceServer/hasWonRequest" message="tns:hasWon"/>
<output wsam:Action="http://webservice/WebServiceServer/hasWonResponse" message="tns:hasWonResponse"/>
</operation>
</portType>
<binding name="WebServiceServerPortBinding" type="tns:WebServiceServer">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="login">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="logout">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
</operation>
<operation name="createUser">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
<fault name="Exception">
<soap:fault name="Exception" use="literal"/>
</fault>
</operation>
<operation name="createGame">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="makeMove">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="show">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="makeComputerMove">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="hasWon">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="WebServiceServer">
<port name="WebServiceServerPort" binding="tns:WebServiceServerPortBinding">
<soap:address location="http://localhost:39851/CuatroEnRayaServer/WebServiceServer"/>
</port>
</service>
</definitions>